app/controllers/api/categories_controller.rb

  def index
    render json: Category.all
---
SELECT "categories".* FROM "categories"