app/controllers/api/ingredients_controller.rb

  def index
    render json: Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

  def create
    @ingredient = Ingredient.new(ingredient_params)
    if @ingredient.save
---
INSERT INTO "ingredients" ("name", "in_freezer", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Apple"], ["in_freezer", false], ["category_id", 2], ["created_at", 2016-10-14 21:36:11 UTC], ["updated_at", 2016-10-14 21:36:11 UTC]]

  def update
    @ingredient = Ingredient.find(params[:id])
    if @ingredient.update(ingredient_params)
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "ingredients" SET "purchase_date" = ?, "expiration_date" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["purchase_date", Sun, 16 Oct 2016], ["expiration_date", Sun, 23 Oct 2016], ["updated_at", 2016-10-17 02:33:04 UTC], ["id", 4]]

  def destroy
    @ingredient = Ingredient.find(params[:id])
    @ingredient.destroy
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 3]]