app/controllers/api/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
      if @recipe.save
---
INSERT INTO "recipes" ("title", "image_url", "source_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)